Конфигурация/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/CommonModules/РаботаСВалютами/Ext/Module.bsl
Функция ПолучитьКоэффициентКурсаВалюты(Валюта, ДатаКурса, Отказ = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не указана валюта'"),,,, Отказ);
		Возврат 0;
	КонецЕсли;
	
	Курс = 0;
	Кратность = 0;
	СтруктВалюта = Новый Структура("Валюта", Валюта);
	
	Если ТипЗнч(ДатаКурса)= Тип("Число") Тогда
		Курс = ДатаКурса;
		Кратность = РегистрыСведений.КурсыВалют.Получить(НачалоДня(ТекущаяДата()), СтруктВалюта).Кратность;
	ИначеЕсли ТипЗнч(ДатаКурса)= Тип("Дата") Тогда
		КурсЗапись = РегистрыСведений.КурсыВалют.Получить(НачалоДня(ДатаКурса), СтруктВалюта);
		Курс = КурсЗапись.Курс;
		Кратность = КурсЗапись.Кратность;
	ИначеЕсли ТипЗнч(ДатаКурса)= Тип("Строка") Тогда
		//на случай курса валюты с большой точностью
		Курс = Число(ДатаКурса);
		Кратность = РегистрыСведений.КурсыВалют.Получить(НачалоДня(ТекущаяДата()), СтруктВалюта).Кратность;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неверный тип параметра 'Дата курса' при получении курса валюты!",,,, Отказ);
		Возврат 0;
	КонецЕсли;
	
	Если Курс = 0 Тогда
		
		Если ТипЗнч(ДатаКурса)= Тип("Дата") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Загрузите курс валюты " + Валюта + " на " + НачалоДня(ДатаКурса) + "!'"),,,, Отказ);
		ИначеЕсли ТипЗнч(ДатаКурса)= Тип("Число") Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Укажите курс или дату курса валюты " + Валюта + "!'"),,,, Отказ);	
		КонецЕсли;
		
		Возврат 0;
		
	КонецЕсли;
	
	Кратность = ?(Кратность=0,1,Кратность);
	Возврат Курс/Кратность;
	
КонецФункции

Функция ПересчетСуммыВВалюте(Сумма, ВалютаНач, КурсВалютыНач, ВалютаКон, КурсВалютыКон, Отказ = Неопределено) Экспорт
	
	Если ВалютаКон = Справочники.Валюты.ПустаяСсылка() Тогда
		//будем считать что валюта та же
		Возврат Сумма;
	КонецЕсли;
	
	Если ВалютаНач = ВалютаКон Тогда
		Возврат Сумма;
	КонецЕсли;
	
	КоэффициентКурсаНач = ПолучитьКоэффициентКурсаВалюты(ВалютаНач, КурсВалютыНач, Отказ);
	КоэффициентКурсаКон = ПолучитьКоэффициентКурсаВалюты(ВалютаКон, КурсВалютыКон, Отказ);
	
	Если КоэффициентКурсаКон = 0 Тогда
		Возврат 0;
	Иначе 
		Возврат Сумма * КоэффициентКурсаНач / КоэффициентКурсаКон;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСуммыВВалютеУчета(СуммыВВалюте, Валюта, Организация, Период, КурсВалюты = Неопределено, Отказ = Ложь) Экспорт
	
	Если Валюта = Организация.ВалютаУчета Тогда
		Возврат СуммыВВалюте;
	КонецЕсли;
	
	Если КурсВалюты = Неопределено Тогда	
		КурсыВалют = РегистрыСведений.КурсыВалют.Получить(НачалоДня(Период), Новый Структура("Валюта", Валюта));
		КурсыВалют.Кратность = ?(КурсыВалют.Кратность = 0, 1, КурсыВалют.Кратность);
	Иначе
		КурсыВалют = Новый Структура("Курс, Кратность", КурсВалюты, 1);	
	КонецЕсли;
	
	Если КурсыВалют.Курс > 0 Тогда
		КоэффициентКурса = КурсыВалют.Курс / КурсыВалют.Кратность;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Загрузите курс валюты " + Валюта + " на " + НачалоДня(Период) + "!'"),,,, Отказ);
		КоэффициентКурса = 0;
	КонецЕсли; 
	
	Для каждого СуммаВВалюте Из СуммыВВалюте Цикл 			
		СуммыВВалюте[СуммаВВалюте.Ключ] = СуммаВВалюте.Значение * КоэффициентКурса;
	КонецЦикла;
	 
	Возврат СуммыВВалюте;
	
КонецФункции // ПолучитьСуммыВВалютеУчета

Функция ПолучитьСуммуВВалютеУчета(СуммаВВалюте, Валюта, Организация, Период, Отказ = Ложь) Экспорт
	
	Возврат ПолучитьСуммыВВалютеУчета(Новый Структура("Сумма", СуммаВВалюте), Валюта, Организация, Период, , Отказ).Сумма;

КонецФункции // ПолучитьСуммуВВалютеУчета

Функция ПолучитьСуммуДокументаВВалютеУчета(СуммаВВалюте, Валюта, РеквизитыДокумента, Отказ = Ложь) Экспорт 

	Возврат ПолучитьСуммуВВалютеУчета(СуммаВВалюте, Валюта, РеквизитыДокумента.Организация, РеквизитыДокумента.Дата, Отказ);
	 
КонецФункции // ПолучитьСуммуДокументаВВалютеУчета

Функция ПолучитьСуммыДокументаВВалютеУчета(СуммыВВалюте, Валюта, РеквизитыДокумента, Отказ = Ложь) Экспорт 

	Возврат ПолучитьСуммыВВалютеУчета(СуммыВВалюте, Валюта, РеквизитыДокумента.Организация, РеквизитыДокумента.Дата, , Отказ);
	 
КонецФункции // ПолучитьСуммыДокументаВВалютеУчета

Функция ПолучитьДанныеКурсовЗаЭтотИПредыдущийДень(ДатаКурса) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КурсыВалютЗаЭтотДень.Валюта КАК Валюта,
		|	КурсыВалютЗаЭтотДень.Курс КАК КурсЭтотДень,
		|	КурсыВалютЗаЭтотДень.Кратность КАК КратностьЭтотДень,
		|	КурсыВалютЗаПредыдущийДень.Курс КАК КурсПредыдущийДень,
		|	КурсыВалютЗаПредыдущийДень.Кратность КАК КратностьПредыдущийДень,
		|	КурсыВалютЗаПредыдущийРабочийДень.Курс КАК КурсПредыдущийРабочийДень,
		|	КурсыВалютЗаПредыдущийРабочийДень.Кратность КАК КратностьПредыдущийРабочийДень,
		|	ВЫБОР
		|		КОГДА КурсыВалютЗаЭтотДень.Курс <> КурсыВалютЗаПредыдущийДень.Курс
		|				ИЛИ КурсыВалютЗаЭтотДень.Кратность <> КурсыВалютЗаПредыдущийДень.Кратность
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КурсИзменился,
		|	ВЫБОР
		|		КОГДА КурсыВалютЗаЭтотДень.Курс <> КурсыВалютЗаПредыдущийРабочийДень.Курс
		|				ИЛИ КурсыВалютЗаЭтотДень.Кратность <> КурсыВалютЗаПредыдущийРабочийДень.Кратность
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КурсРабочихДнейИзменился,
		|	ВЫРАЗИТЬ(КурсыВалютЗаЭтотДень.Курс / КурсыВалютЗаЭтотДень.Кратность КАК ЧИСЛО(21, 12)) КАК Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалютЗаЭтотДень
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютЗаПредыдущийДень
		|		ПО КурсыВалютЗаЭтотДень.Валюта = КурсыВалютЗаПредыдущийДень.Валюта
		|			И (КурсыВалютЗаЭтотДень.Период = &ЭтотДень)
		|			И (КурсыВалютЗаПредыдущийДень.Период = &ПредыдущийДень)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалютЗаПредыдущийРабочийДень
		|		ПО КурсыВалютЗаЭтотДень.Валюта = КурсыВалютЗаПредыдущийРабочийДень.Валюта
		|			И (КурсыВалютЗаЭтотДень.Период = &ЭтотДень)
		|			И (КурсыВалютЗаПредыдущийРабочийДень.Период = &ПредыдущийРабочийДень)";
	
	Запрос.УстановитьПараметр("ПредыдущийДень", НачалоДня(ДатаКурса) - 86400);
	Запрос.УстановитьПараметр("ЭтотДень", НачалоДня(ДатаКурса));
	Запрос.УстановитьПараметр("ПредыдущийРабочийДень", Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, НачалоДня(ДатаКурса - 1)));
	
	Возврат Запрос.Выполнить().Выгрузить();
	        
КонецФункции
